//
// \d
// //匹配数字
// \w
// //匹配字母或者数字
// \s
//     //匹配一个空格或一个Tab
// .
// //匹配任意字符
// *
//     //任意个字符（包括0个）
// +
//     //至少一个字符
// ?
//     //0或1个字符
// {n} {n,m}
// //n个字符，n到m个字符
// \d{3}\s+\d{3,8}//3个数字至少一个空格或者Tab 3到8个数字
// \d{3}\-d{3,8}//'010-12345'
//
// [0-9a-zA-Z\_] \\匹配一个数字、字母、或者下划线
// [0-9a-zA-Z\_]+ \\匹配至少由一个数字、字母 或 下划线组成的字符串，如‘a100’
// [a-zA-Z\_\$][0-9a-zA-Z\_\$]{0,19} //匹配至少一个字母或者下划线、$开头，后接一个数字、字母或者下划线、%$组成的字符串
// ^
// //表示行开头
// $
// //表示行结束
`use strict`;
//建立正则表达式两种方法
// var re1 = /ABC\-001/;
// var re2 = new RegExp('ABC\\-001');
// console.log(re1);
// console.log(re2);
// var re = /^\d{3}\-\d{3,8}$/;
// console.log(re.test('010-12345'));
var re1 = /[0-9a-zA-Z\_]/;
console.log(re1.test('2aaa'));

